---
layout: post
title: "深度学习在股票选择与预测中的应用研究"
date:   2020-05-28
tags: [股票,50,编码器,RMSE,研究]
comments: true
author: admin
---
# 深度学习在股票选择与预测中的应用研究

## 资源文件描述

本文对股票的选择过程进行了系统分析，并使用深度学习对该股票进行了预测。无需任何先验知识即可学习庞大的原始数据集并从中提取重要数据的能力使其具有吸引力。深度学习模型的性能高度依赖于优化器、损失函数、网络结构、激活函数和其他参数。本文旨在研究自动编码器神经网络在选股过程中的性能，并使用长短期记忆（LSTM）模型对这些股票进行未来预测。

该研究涉及标准普尔500指数中每家公司2013年至2018年的5年静态每日数据。该研究的假设是，用户愿意将固定数量的股票投资并已经拥有股票。自动编码器已应用于主要根据用户要投资的数量和所有股票的最后一天收盘价进行过滤以考虑承受能力的股票。原始数据和重新创建的数据之间的RMSE得分将用于选择股票。

考虑到用户的行为是中立的，因此选择了RMSE得分最低的前50只股票和RMSE得分最高的倒数50只股票。这些选定股票的潜在特征将被检查。在这100种股票中，将通过检查它们与用户已经拥有的股票之间的相关性来选择不同行业的20种股票。LSTM模型将使用adam优化器预测这20只股票的第二天未来价格，经验结果表明，RMSE得分最低的前50只股票将带来低回报和低风险。这意味着自动编码器结果中排名前50位的股票为蓝筹股。同样，具有高RMSE得分的排名前50位的股票也会带来高风险的高回报。这意味着自动编码器结果中的前50名股票给出了小盘股。

自编码器神经网络后，相关估计得到了显着改善。通过使用adam优化程序，使用LSTM进行的未来一天库存预测可以提供均方根误差为2.22的高精度。我们的研究提供了一些见解和有用的路线图，可用于进一步研究使用深度学习网络进行的股票市场分析和预测。

## 如何使用

1. **下载资源文件**：点击下载按钮获取研究论文的PDF文件。
2. **阅读研究论文**：详细了解深度学习在股票选择与预测中的应用。
3. **参考研究结果**：根据论文中的方法和结果，进行进一步的研究或应用。

## 贡献

如果您对本文的研究有任何改进建议或发现任何错误，欢迎通过提交Issue或Pull Request的方式进行贡献。

## 许可证

本资源文件遵循[MIT许可证](https://opensource.org/licenses/MIT)。

## 下载链接

[深度学习在股票选择与预测中的应用研究](https://pan.quark.cn/s/4bc4fa887d85)