---
layout: post
title: "基于流程图实现无代码编程业务逻辑（2）"
date:   2022-07-03
tags: [控件,容器,步骤,逻辑,实现]
comments: true
author: admin
---
# 基于流程图实现无代码编程业务逻辑（2）

## 资源描述

在我们编写运动控制上位机程序时，常常需要考虑如何实现一个流程。我们需要思考，完成当前步骤后，下一个步骤要实现什么，判断条件是什么，满足条件后的步骤是什么，不满足条件的步骤又是什么，或者需要一直等待条件满足才开始下一个步骤，也要考虑超时都不满足条件需要走另一个步骤，根据条件也有可能会跳转回原来的步骤。这些逻辑通常非常繁琐（使用if-elseif、switch-case），而且写好后再次修改时，容易漏改忘改等造成逻辑不稳定问题。

为了解决这些问题，我们介绍一种全新的实现逻辑的方式：通过流程图的原理去实现这些业务性的繁琐逻辑，实现**逻辑可视化，编程拖拉拽**。在前面的文章中，我们已经实现了第一步，完成了控件的拖拉拽，但还有以下问题点当时是没有优化的，也是为了突出强调拖拉拽功能的实现。接下来，我们将完善以下功能的实现：

1. **控件只能放进指定的容器内**：确保控件只能在指定的容器内进行拖放操作，避免控件超出容器的范围。
2. **只能在容器内部移动**：控件在容器内部可以自由移动，但不能移出容器的边界。
3. **容器有默认的大小**：容器具有默认的大小，确保控件在初始状态下能够合理布局。
4. **超出大小容器要自动扩展**：当控件超出容器的默认大小后，容器能够自动扩展，以适应控件的布局需求。

通过这些功能的完善，我们将进一步提升流程图的可视化编程体验，使得业务逻辑的实现更加直观和高效。具体实现细节请参考本资源文件中的内容！

## 下载链接

[基于流程图实现无代码编程业务逻辑2](https://pan.quark.cn/s/327cbfd2594f)