---
layout: post
title: "Foobar2000 FlatLite 整合版"
date:   2024-03-06
tags: [Foobar2000,封面,FlatLite,JS,Chromo]
comments: true
author: admin
---
# Foobar2000 FlatLite 整合版

## 简介
Foobar2000 FlatLite 整合版是一款简洁、大封面的音乐播放器主题，采用JS面板设计，支持颜色变换和高分屏显示。主题包含Dark、Lunar和Chromo三种配色，其中Chromo能根据封面调整颜色。此外，它还支持视频播放和迷你窗模式，提供快捷命令行操作。

## 主要特点
- **简洁大封面设计**：采用简洁的界面设计，突出音乐封面。
- **JS面板支持**：每个面板都是独立的JS面板，图标由JS脚本绘制，支持颜色的自由变换。
- **多配色选择**：提供Dark、Lunar和Chromo三种配色，Chromo能根据封面自动调整颜色。
- **高分屏支持**：原生支持2K与4K高分屏显示，自动根据屏幕分辨率切换UI主题。
- **视频播放**：支持视频播放功能，增强多媒体体验。
- **迷你窗模式**：提供迷你窗模式，方便在桌面其他任务中使用。
- **快捷命令行操作**：提供快捷命令行操作，方便用户快速控制播放器。

## 安装与使用
1. **下载整合版**：从本仓库下载Foobar2000 FlatLite 整合版。
2. **解压文件**：将下载的文件解压到Foobar2000的安装目录。
3. **启动Foobar2000**：启动Foobar2000，主题将自动应用。
4. **配置与个性化**：根据个人喜好调整配色和界面布局。

## 注意事项
- 本主题只支持32位Foobar2000，因为所使用的主要组件均没有64位版本。
- 播放器的配置与播放列表等数据保存在Foobar2000\profile目录下。
- 如需关联文件，请以管理员身份运行“文件关联设置.bat”批处理文件。

## 版本更新
- **最新版**：新增旋转封面功能，由于组件设计的绘图刷新缺陷，封面的旋转速度设为较慢，以避免性能影响。

## 反馈与支持
如有任何问题或建议，欢迎在GitHub仓库中提交Issue，我们将尽快回复并提供支持。

---

希望您能享受Foobar2000 FlatLite 整合版带来的全新音乐播放体验！

## 下载链接

[Foobar2000FlatLite整合版](https://pan.quark.cn/s/579d8685627a)