---
layout: post
title: "EndNode X9安装使用教程"
date:   2024-06-27
tags: [账号,X9,点击,下载,安装]
comments: true
author: admin
---
# EndNode X9安装使用教程

本仓库提供EndNode X9的安装使用教程资源文件，帮助用户快速上手并掌握EndNode X9的使用方法。

## 内容概述

- **下载授权版**：提供了中科大授权版的下载链接和提取码。
- **安装步骤**：详细介绍了如何下载并解压文件，运行msi文件进行安装。
- **使用指南**：包括打开软件、注册账号、快速上手教程、分享group和library等功能的使用方法。
- **添加引文**：提供了《手把手教你使用EndNote X9》的下载链接，帮助用户学习如何添加引文。

## 安装步骤

1. **下载授权版**：点击下载中科大授权版，提取码为dgxk。
2. **解压并安装**：下载并解压后，运行msi文件，点击next直到安装成功。

## 使用指南

1. **打开软件**：安装成功后，打开EndNode X9，出现弹窗可以直接取消，或者创建账号。
2. **注册账号**：若没有账号，需注册一个账号：Edit–>Preferences–>Sync–>Enable Sync–>Sign Up，按照提示创建完，点击OK即可同步账号。
3. **快速上手**：提供了《手把手教你使用EndNote X9》的下载链接，帮助用户快速上手。
4. **分享group**：点击Share Group后，在弹出的窗口中，在“Invite More People”栏中输入被邀请这的账号，点击Invite即可，其中在Permission中可以设置被邀请方的读写权限。
5. **分享Library**：可以多人同时对一个library进行操作，点击后添加被邀请者的账号，点击Invite即可，同样被邀请这需要在邮箱确认接收邀请。

## 添加引文

此操作可参考《手把手教你使用EndNote》。

## 免责声明

本博客所发布的一切内容仅限用于学习目的，不得将上述内容用于商业或者非法用途，否则，一切后果请用户自负。

## 下载链接

[EndNodeX9安装使用教程](https://pan.quark.cn/s/00f1bb7559f8)