---
layout: post
title: "NXP在线调试工具FreeMaster使用教程"
date:   2020-02-12
tags: [FreeMaster,变量,调试,点击,实时]
comments: true
author: admin
---
# NXP在线调试工具FreeMaster使用教程

FreeMaster是一款由NXP提供的图形化在线调试工具，支持多种通信接口，如RS232、JTAC、CAN等。该工具提供实时变量监视、虚拟示波器功能，便于对嵌入式软件进行调试和优化。本文介绍了FreeMaster的安装步骤及使用说明，包括创建项目、设置通信接口、观察变量等操作，适合于进行实时数据监测和程序调试。

## 简介

FreeMASTER是一个用户友好的实时调试监视器和数据可视化工具，它支持嵌入式软件应用程序的运行时配置和调优。无论是汽车原始设备制造商和行业领先的家电制造商广泛采用FreeMASTER，因为它适用于广泛的汽车和工业应用。

## 特点

1. 图形化调试环境
2. 支持RS232通信接口和JTAC、CAN等接口
3. 虚拟化示波器并实时跟踪显示工程中的变量
4. 通过目标板上的记录区（Recorder）快速读取数据
5. 内置支持标准数据类型（整型、浮点型等）
6. 支持Active X 接口支持VBScript和JScript
7. 支持Matlab仿真接口

## 安装

安装步骤比较简单，这里就不详细说了。下面附上安装包地址。

## 使用说明

1. 安装完成后，打开软件，界面如下图所示。
2. 右击【New Preject】点击【Properties】。
3. 更改项目名与描述，点击确定后，保存该项目。
4. 在【Project】中，点击【Options】。
5. 根据自己的情况设置通讯接口。
6. 根据图片设置Symbol来源。
7. 设置成功后，点击【View】，便可查看程序中所支持的变量。
8. 右击【New Preject】点击【Create Scope】。
9. 更改名字与描述，成功后变出现虚拟示波器窗口。
10. 右击【Name】下方的空白区域，创建一个新的观察变量【Create New Watched Variable】。
11. 根据图片中内容进行观察变量的创建。
12. 点击【Modifying】可对变量进行更多设置，例如图片中的步进调节设置。
13. 可按照之前步骤对多个变量进行创建设置，在虚拟示波器右击可对创建的变量进行波形显示。
14. 测试截图。
15. 对于一些变量，可在FreeMaster上直接更改并且在芯片中更新，这可谓是FreeMaster的强大之处。

## 总结

FreeMaster这款软件功能非常强大，使用非常方便。我也是刚刚开始使用，在这里只是对他基础的功能做了详解。因为他可对程序中变量实时显示和实时更新，在调节PID时非常的方便。希望各位打大佬可研究出其他功能，大家多多交流。

## 下载链接

[NXP在线调试工具FreeMaster使用教程](https://pan.quark.cn/s/fe02841ecebd)