---
layout: post
title: "Kitti部分数据集下载"
date:   2023-10-27
tags: [Kitti,数据,50,学习,压缩文件]
comments: true
author: admin
---
# Kitti部分数据集下载

## 描述
该压缩文件为Kitti的部分数据集，用于配合我的ROS学习19的博客使用。由于Kitti的数据集原本非常庞大，大约有60个G，因此我只截取了其中的50个数据，即50张图片，总大小约为40M。这些数据用于帮助我们学习Kitti数据集的特征点提取和暴力匹配。虽然原始数据集太大，但我们可以通过截取一部分来方便学习和使用。

## 使用说明
1. 下载该压缩文件。
2. 解压缩后，您将获得50张Kitti数据集的图片。
3. 这些图片可以用于特征点提取和暴力匹配的学习和实验。

## 注意事项
- 该数据集仅为Kitti数据集的一小部分，适合初学者或需要快速实验的场景。
- 如果您需要完整的数据集，请访问Kitti官方网站获取。

希望这些数据能够帮助您更好地学习和理解Kitti数据集的使用！

## 下载链接

[Kitti部分数据集下载](https://pan.quark.cn/s/5e73e11087b3)