---
layout: post
title: "计算机图形学原理及实践C语言描述"
date:   2020-01-19
tags: [图形学,C语言,计算机,光栅,描述]
comments: true
author: admin
---
# 计算机图形学原理及实践C语言描述

本书被誉为计算机图形学领域的扛鼎之作，由业界权威学者Foley、Van Dam等人联合撰写，其英文原版长期作为全球高校计算机图形学课程的核心教材。经过清华大学、北京大学、中国科学院计算技术研究所及软件研究所多位顶级专家的精心翻译，此中文版本得以问世，为中国读者打开了通往图形学深奥殿堂的大门。

全书划分为基础知识、用户界面、模型定义与图像合成四大篇章，系统性地覆盖了从基本概念到前沿技术的广泛内容。从二维与三维图形的数学根基出发，深入讲解光栅图形学的基础算法，详述图形硬件与软件的运作机制，探讨几何变换、三维视图渲染、对象层次管理等核心理论，并介绍了SPHIGS系统和先进的交互技术。此外，对颜色理论、可视化的真实感渲染、可见面判断、光照模型、图像处理技术、高级光栅架构以及动画制作进行了深入剖析。

本书不仅适合计算机科学专业的本科生和研究生作为学习计算机图形学的教材，也极大程度上满足了专业技术人员在实际工作中的需求，成为提升自我、探索图形学前沿知识的宝贵资源。书中穿插的丰富习题与广泛的参考文献，以及用C语言编写的实用算法示例，均为读者提供了宝贵的自学与研究工具。

综上所述，《计算机图形学原理及实践C语言描述》不仅是学术界和教育界的重要资源，也是每位致力于计算机图形学研究与应用开发者的案头必备之选。

## 下载链接

[计算机图形学原理及实践C语言描述分享](https://pan.quark.cn/s/719b1f67d5b2)