---
layout: post
title: "统一监管报送平台系统功能介绍"
date:   2022-05-27
tags: [报送,监管,报表,金融机构,平台]
comments: true
author: admin
---
# 统一监管报送平台系统功能介绍

## 资源文件描述

### 1. 统一监管报送平台功能介绍

#### 1.1 背景分析

随着中国经济的飞速发展，近年来中国的金融行业也处在飞速的发展阶段，银行的改制、分支机构的扩张、异地分行的开设、村镇银行的兴起、财务公司的成立等，均可以看出中国的金融行业的发展已经进入到了前所未有的阶段。然而随着金融行业的飞速发展，中国的监管当局也不断加大对各金融机构的监管力度，中国的三大监管机构银监会、人民银行和外管局也都需要金融机构按照不同的要求、方式等报送报表或数据，通过这些报表和数据的进一步分析结果来对金融机构制定不同的监管策略。

从目前情形来看，各金融机构，尤其是商业银行，为应对三大监管机构的监管要求所需要报送的内容给商业银行的业务人员带来了繁重的工作压力。在这种情况下，就需要有一套统一的监管报送平台来完成这些报表、数据的自动化生成工作，使用这种自动化的方式代替传统的手工填报的方式。这样既减轻了业务人员的工作压力，也保证了所报送的报表、数据的准确性。因此，对金融机构来说，建立一套统一的监管报送平台是非常必要的。

在本方案中主要包括以下两个主要的报送模块：银监会 1104 报送、人民银行大集中报送。中软融鑫公司利用公司自有的产品“统一监管报送平台”来实现。

## 下载链接

[统一监管报送平台系统功能介绍分享](https://pan.quark.cn/s/36b4245828ed)