---
layout: post
title: "EN IEC 61000-6-4-2019 资源文件下载"
date:   2022-10-09
tags: [标准,EMC,EN,61000,2019]
comments: true
author: admin
---
# EN IEC 61000-6-4-2019 资源文件下载

## 资源描述

本仓库提供了一个名为 **EN IEC 61000-6-4-2019** 的资源文件下载。该文件是关于电磁兼容性（EMC）的标准文档，具体为 **EN 61000-6-4** 标准的2019年版本。

## 文件内容概述

**EN 61000-6-4** 是电磁兼容性（EMC）标准的第6-4部分，主要针对工业环境的排放标准。该标准适用于在工业场所（包括室内和室外，或靠近工业电源装置的地方）使用的电气和电子设备。标准涵盖了从0 Hz至400 GHz频率范围内的干扰问题。

如果相关设备不存在专用产品或产品系列的EMC排放标准，则应遵循此通用EMC排放标准。此外，该标准还与中国的 **GB/T 17799-4** 标准相对应。

## 适用范围

该标准适用于以下情况：

- 在工业环境中使用的电气和电子设备。
- 不存在专用产品或产品系列EMC排放标准的设备。
- 需要遵循通用EMC排放标准的设备。

## 下载说明

请在仓库中找到并下载 **EN IEC 61000-6-4-2019** 文件，以便获取详细的EMC标准信息。

## 注意事项

- 该文件为标准文档，适用于相关领域的专业人士和工程师。
- 请确保在实际应用中遵循最新的标准和法规。

希望本资源对您的工作和研究有所帮助！

## 下载链接

[ENIEC61000-6-4-2019资源文件下载](https://pan.quark.cn/s/72130d7aaa0e)