---
layout: post
title: "浙江省谷歌地球高程DEM等高线下载"
date:   2022-10-11
tags: [DEM,高程,浙江省,谷歌,下载]
comments: true
author: admin
---
# 浙江省谷歌地球高程DEM等高线下载

## 概述
浙江省，简称“浙”，省会杭州，地处中国东南沿海长江三角洲南翼，东临东海，南接福建，西与安徽、江西相连，北与上海、江苏接壤。浙江省东西和南北的直线距离均为450公里左右，土地面积10.55万平方公里，是中国面积较小的省份之一。浙江是典型的山水江南、鱼米之乡，被称为“丝绸之府”、“鱼米之乡”，拥有丰富的历史文化遗产和自然景观。

## 数据下载
本资源文件提供了浙江省谷歌地球高程DEM等高线的离线数据包，大小为175.9M。该数据包可以从百度网盘中直接下载，解压后的目录中主要包括浙江省谷歌地球高程DEM数据（dat、idx和kml文件）。

## 数据导出
用户可以通过“水经注万能地图下载器”导出高程数据为TIF文件。具体步骤如下：
1. 下载并安装“水经注万能地图下载器”。
2. 启动软件后，点击“任务列表”打开下载任务列表。
3. 在下载任务列表中，点击“导入”按钮，选择需要导入的“浙江省谷歌地球高程DEM数据.dat”文件。
4. 单击列表中的文件名称，查看数据的完整性，有数据为绿色点，无数据为蓝色点。
5. 点击“导出”按钮，选择导出文件存储格式、坐标投影和设置背景透明等参数，设置完成后点击“确定”导出数据。

## 数据查看
谷歌地球高程DEM数据需要在专业软件中打开查看，如GlobalMapper或ArcGIS等。以GlobalMapper为例，将“浙江省谷歌地球高程DEM数据.tif”文件拖放到GlobalMapper中即可打开。

## 数据应用
导出的TIF高程DEM文件可以通过GlobalMapper或ArcGIS等专业软件提取等高线或生成三维地形，适用于三维仿真、三维地形建模或构建虚拟三维场景等应用。

## 结语
本资源文件提供了浙江省谷歌地球高程DEM等高线的离线数据包，用户可以根据实际应用需求，通过万能地图下载器导出为西安80或北京54坐标系的TIF高程文件，进一步应用于各种地理信息系统项目中。

## 下载链接

[浙江省谷歌地球高程DEM等高线下载分享](https://pan.quark.cn/s/8f3cc095baf7)