---
layout: post
title: "嵌入式深度学习"
date:   2023-07-28
tags: [嵌入式,神经网络,深度,算法,学习]
comments: true
author: admin
---
# 嵌入式深度学习

本书深入探讨了算法和硬件实现技术，以促进嵌入式设备上的深度学习应用。作者通过阐述在应用、算法、计算机架构及电路层面的协同设计方法，旨在展示如何有效降低深度学习算法的计算成本。这些技术的影响体现在四个针对嵌入式深度学习设计的硅片原型上，覆盖了从电池受限的可穿戴设备上的高效神经网络解决方案到实际芯片级的优化实践。

**主要内容特色：**
- **全面概览**：提供了广泛视角，聚焦于适用于电池驱动设备的节能神经网络系列解决方案。
- **层级优化**：详细讨论如何在应用、算法、硬件架构和电路的所有设计层面上优化神经网络，为了嵌入式部署进行全方位调优，并辅以真实的硅片原型实例。
- **高效处理器设计**：深入讲解如何设计高效的卷积神经网络(CNN)处理器，这包括利用并行性、数据复用、稀疏操作以及低精度计算等策略。
- **实现实例分析**：书中详尽介绍了四个真实硅片原型的实现过程与性能成就，通过这些实例深刻阐释跨层设计理念的实际效果。

无论是对于正在探索深度学习在嵌入式系统中应用的研究者，还是致力于开发更高效能低功耗硬件平台的工程师，这本书都是一份宝贵的参考资料，引领读者深入了解这一领域中的前沿技术和挑战解决之道。

## 下载链接

[嵌入式深度学习](https://pan.quark.cn/s/e15108381d53)