---
layout: post
title: "ISO14443协议中文完整版"
date:   2020-04-26
tags: [ISO14443,PICC,ISO,IEC,14443]
comments: true
author: admin
---
# ISO14443协议中文完整版

## 资源描述

本资源文件为《ISO14443协议中文完整版》，详细介绍了ISO/IEC 14443标准的各个部分，涵盖了接近式卡（PICC）和接近式耦合设备（PCDs）之间的通信协议。该规范主要分为以下几个部分：

### 1. 物理特性
本部分规定了接近式卡（PICC）的物理特性，等同于ISO/IEC 14443-1内容。

### 2. 射频功率和信号接口
本部分规定了在接近式耦合设备（PCDs）和接近式卡（PICCs）之间提供功率和双向通信的场的性质与特征。本部分没有规定产生耦合场的方法，也没有规定遵循电磁场辐射和人体辐射安全的规章，等同于ISO/IEC 14443-2内容。

### 3. 初始化和防冲突
本部分描述了PICC进入PCD工作场的轮询；在PCD和PICC之间通信的初始阶段期间所使用的字节格式、帧和定时；初始REQ和ATQ命令内容；探测方法和与几个卡（防冲突）中的某一个通信的方法；初始化PICC和PCD之间的通信所需要的其它参数；容易和加速选择在应用准则基础上的几个卡中的一个（即，最需要处理的一个）的任选方法，等同于ISO/IEC 14443-3内容。

### 4. 传输协议
本部分规定了以无触点环境中的特殊需要为特色的半双工传输协议，并定义了协议的激活和停活序列。这一部分适用于类型A和类型B的PICC，等同于ISO/IEC 14443-4内容。

### 5. 数据元和命令集
本部分定义了金融应用中关闭和激活非接触式通道所使用的一般数据元、命令集和对终端响应的基本要求。

## 使用说明

本资源文件为ISO14443协议的中文完整版，适用于需要了解和应用ISO14443标准的工程师、研究人员和相关领域的专业人士。通过阅读本文件，您可以全面了解ISO14443协议的各个部分，并将其应用于实际项目中。

## 注意事项

- 本资源文件仅供学习和研究使用，请勿用于商业用途。
- 如有任何疑问或需要进一步的技术支持，请联系相关领域的专业人士。

希望本资源文件能够帮助您更好地理解和应用ISO14443协议。

## 下载链接

[ISO14443协议中文完整版分享](https://pan.quark.cn/s/6179f0840642)