---
layout: post
title: "清洗后的Kaist数据集"
date:   2024-05-05
tags: [数据,Kaist,行人,清洗,图片]
comments: true
author: admin
---
# 清洗后的Kaist数据集

## 简介
本资源文件提供了一个经过清洗和重新标注的Kaist行人数据集。该数据集包含RGB彩色图像和红外图像两个版本，适用于行人检测和行人属性分析等任务。

## 数据集详情
- **原数据集**: 包含95328张图片，每张图片都包含RGB彩色图像和红外图像两个版本，总共包含103128个密集注释。
- **重新标注**: 训练集每隔2张图片取一张，既每3张取一张，并去掉所有不包含任何行人的图片。经过此操作可得到7601张训练集图片，其中4755张白天的，2846张夜晚的。测试集每隔19张取一张，既每20张取一张，保留负样本。经此操作可得到2252张图片，其中1455张白天，797张夜晚。
- **标签**: 标签中只保留了person，其余均删去。

## 使用说明
该数据集适用于行人检测和行人属性分析等任务，可以直接用于训练和测试模型。

## 注意事项
- 数据集已经过清洗和重新标注，确保了数据的质量和一致性。
- 数据集分为训练集和测试集，分别用于模型的训练和评估。

## 参考资料
如需了解更多关于数据集的详细信息，请参考[清洗后的Kaist数据集](https://blog.csdn.net/m0_53392188/article/details/125471013)。

## 下载链接

[清洗后的Kaist数据集](https://pan.quark.cn/s/7698d2eb90d4)