---
layout: post
title: "电能质量分析与控制 - 肖湘宁著"
date:   2022-11-19
tags: [电能,质量,肖湘宁著,电气工程,读者]
comments: true
author: admin
---
# 电能质量分析与控制 - 肖湘宁著

## 内容简介

《电能质量分析与控制》是由肖湘宁教授编著，中国电力出版社出版的普通高等教育“十一五”国家级规划教材。此书深入浅出地介绍了电能质量管理领域的核心知识与最新进展，是电气工程及其自动化领域内的重要学习资料。

本书涵盖的内容广泛而深入，从电能质量的基础理论入手，逐步探讨复杂的分析技术和控制策略。各章节详细讲解了电能质量概论、数学分析方法在电能质量中的应用、传统的与现代的电能质量改善措施。特别地，书中对电压波动与闪变、电压暂降、电力谐波等关键问题进行了系统分析，同时也介绍了电力系统中的现代电能质量控制技术。此外，还涉及电能质量的评估体系、相关国际与国家标准，以及电磁兼容的基础知识。

每一章结尾都配备了思考题与习题，旨在帮助读者巩固理解并深化实践能力。附录部分精心整理了电能质量技术术语的中英文对照，以及关键的标准指标汇总，为读者提供了便利的参考资料。

## 适用对象

- 高校电气工程及相关专业的学生，可作为专业课程的学习教材。
- 研究生群体，用于进行更深入的电能质量专题研究。
- 从事电力工程的技术人员，以提升其在实际工作中解决电能质量问题的能力。
- 对电能质量有兴趣的研究者和专业人士，用作自我提升的工具书。

通过阅读本书，读者不仅能掌握电能质量的基本概念和分析方法，还能了解到控制技术和国际标准，对于理解和提高电力系统的性能至关重要。

## 下载链接

[电能质量分析与控制-肖湘宁著分享](https://pan.quark.cn/s/feee758a44ad)