---
layout: post
title: "拳皇人物动作素材图 61种"
date:   2022-09-29
tags: [素材,拳皇,游戏,61,二次开发]
comments: true
author: admin
---
# 拳皇人物动作素材图 61种

## 简介
本资源文件包含61种《拳皇》游戏中的人物动作素材图，适用于游戏开发者在Unity3D或其他游戏引擎中进行二次开发和使用。这些素材图提取自《拳皇MUGEN高AI版【2013】》，并以Png格式提供，方便开发者直接使用。

## 内容说明
1. **素材来源**：素材提取自《拳皇MUGEN高AI版【2013】》。
2. **文件格式**：所有素材图为Png格式，方便二次使用。
3. **版权声明**：素材源来自于网络，如有侵权，请联系删除。
4. **更新计划**：时间有限，先放上这些素材，后续会将已经有的全部提取出来。
5. **配音计划**：后续有可能会将配音对应打包，如有需求，请联系。

## 使用建议
- 适用于Unity3D或其他游戏引擎的二次开发。
- 可用于仿作《拳皇》类游戏，提供丰富的人物动作素材。
- 请注意版权问题，如有侵权，请联系删除。

## 联系方式
如有任何问题或需求，请联系：
- QQ：1285015525

---

By：YeXiao  
2018/11/10

## 下载链接

[拳皇人物动作素材图61种](https://pan.quark.cn/s/1312c8a32190)