---
layout: post
title: "Win11系统任务栏位置调整工具"
date:   2023-07-07
tags: [任务栏,工具,调整,位置,屏幕]
comments: true
author: admin
---
# Win11系统任务栏位置调整工具

## 简介
本仓库提供了一个用于调整Windows 11系统任务栏位置的工具。通过该工具，用户可以将任务栏调整到屏幕的左侧、顶部或右侧，以满足个性化需求。

## 功能特点
- **任务栏位置调整**：支持将任务栏调整到屏幕的左侧、顶部或右侧。
- **简单易用**：操作步骤简单，用户只需下载并运行工具即可完成任务栏位置的调整。
- **兼容性**：适用于Windows 11家庭中文版，版本号为23H2。

## 使用方法
1. 下载最新的 `ep_setup.exe` 文件。
2. 运行 `ep_setup.exe`，安装完成后，在开始菜单-所有应用中找到属性（ExplorerPatcher）并打开。
3. 在属性窗口中，将主屏和副屏（如果有两个屏幕）任务栏位置调整到左侧/顶部/右侧，然后点击重启文件管理器。

## 注意事项
- 该工具可能存在一些bug，建议在使用前备份重要数据。
- 如果遇到问题，可以前往项目的GitHub地址查看是否有其他用户遇到相同问题。

## 贡献
欢迎提交问题和建议，帮助改进该工具。

## 许可证
本项目遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接和本声明。

## 下载链接

[Win11系统任务栏位置调整工具](https://pan.quark.cn/s/336d6538c8ad)