---
layout: post
title: "医学影像数据集列表"
date:   2020-11-15
tags: [医学影像,数据,影像,数据库,乳腺]
comments: true
author: admin
---
# 医学影像数据集列表

## 描述

本资源文件提供了一个医学影像数据集的列表，涵盖了多种类型的医学影像数据。这些数据集来自不同的来源，包括多模态数据库、活体内显微镜、胚胎和新生小鼠中心、LONI图像数据存档、放射学数据、协作信息学和神经影像套件（COINS）、癌症影像档案库（TCIA）、阿尔茨海默氏病神经影像学倡议（ADNI）、影像研究开放获取系列（OASIS）、乳腺癌数字资料库、DDSM：用于筛查乳腺钼靶的数字数据库、乳房摄影图像分析协会（MIAS）小型数据库等。

## 用户指南

该列表包含了多种医学影像数据集，适用于不同的研究需求。用户可以根据自己的研究方向选择合适的数据集进行下载和分析。数据集涵盖了从超声、乳腺摄影、X射线、CT、MRI、fMRI等多种影像类型，以及乳腺癌、阿尔茨海默氏病等特定疾病的影像数据。

## 数据集来源

- 多模态数据库活体内显微镜（CIVM）
- 胚胎和新生小鼠中心（H＆E，MR）
- LONI图像数据存档
- 放射学（超声，乳腺摄影，X射线，CT，MRI，fMRI等）
- 协作信息学和神经影像套件（COINS）
- 癌症影像档案库（TCIA）
- 阿尔茨海默氏病神经影像学倡议（ADNI）
- 影像研究开放获取系列（OASIS）
- 乳腺癌数字资料库
- DDSM：用于筛查乳腺钼靶的数字数据库
- 乳房摄影图像分析协会（MIAS）小型数据库

## 其他信息

除了上述数据集外，还有更多相关的医学影像数据集可供使用。用户可以根据自己的需求进一步探索和获取更多数据。

## 下载链接

[医学影像数据集列表](https://pan.quark.cn/s/f56af256b9b8)