---
layout: post
title: "ARINC664 P2中文翻译版"
date:   2023-10-02
tags: [中文翻译,文件,ARINC,664,航空]
comments: true
author: admin
---
# ARINC664 P2中文翻译版

## 资源描述

本仓库提供了一份名为“ARINC664 P2中文翻译版”的资源文件下载。该文件是对“飞机数据网络 第二部分以太网物理层和数据链路层规范ARINC SPECIFICATION 664”的中文翻译版本。

## 文件内容

该资源文件详细介绍了ARINC 664规范的第二部分，涵盖了以太网物理层和数据链路层的相关规范。对于从事航空电子系统设计、开发和维护的专业人员来说，这份翻译版文件将提供宝贵的参考资料。

## 适用人群

- 航空电子工程师
- 航空系统设计师
- 航空数据网络研究人员
- 航空电子系统维护人员

## 使用说明

1. 点击下载按钮获取资源文件。
2. 使用PDF阅读器打开文件进行查阅。
3. 根据需要进行打印或保存。

## 注意事项

- 本资源文件为中文翻译版，仅供参考使用。
- 如有疑问或需要进一步的技术支持，请联系相关专业人员。

希望这份资源文件能够帮助您更好地理解和应用ARINC 664规范的相关内容。

## 下载链接

[ARINC664P2中文翻译版分享](https://pan.quark.cn/s/8bdf639eb992)