---
layout: post
title: "制作PE系统U盘"
date:   2023-07-13
tags: [U盘,PE,制作,系统,电脑]
comments: true
author: admin
---
# 制作PE系统U盘

## 简介
PE系统（Preinstallation Environment）是一个在Windows下制作出来的临时紧急系统。当电脑无法正常启动时，可以通过PE系统修复电脑里的各种问题，比如删除顽固病毒、修复磁盘引导分区、给硬盘分区、数据备份、安装电脑系统等。

本资源文件提供了详细的步骤和工具，帮助用户制作一个PE系统U盘，以便在电脑遇到问题时能够快速进行系统维护和修复。

## 前期准备
1. 一枚容量为16G以上的U盘（最好是空的）。
2. 一台正常使用的电脑。

## 下载安装PE系统制作软件
1. 下载PE系统制作软件的压缩包。
2. 解压压缩包，进入名为PE系统的文件夹。
3. 右键选择PE系统.exe，选择以管理员身份运行。

## 开始制作
1. 将U盘插入电脑。
2. 选择安装PE到U盘。
3. 设置U盘的名字，点击立即安装进U盘（注意：安装过程会格式化U盘，如果是非空的U盘请备份U盘文件后再进行安装）。
4. 点击开始制作，等待进度条走满，点击安装完成。在我的电脑里看到除U盘外还有一个EFI分区后，即为制作完成（进度条过程可能有点久）。

## 进入PE系统
1. 把制作好PE系统的U盘插入电脑，开机，不停的按F2（不同主板进入BIOS按键可能不同，本次为小米笔记本，具体可以参考下图）。
2. 在BIOS界面找到Boot下的Boot Devices Order，这里是启动的顺序，按F6将U盘上移，设置为第一启动项，按F10保存，ESC退出等待PE系统启动。
3. 当出现系统桌面的时候，即为启动成功。

## 注意事项
- 制作过程中会格式化U盘，请确保U盘内无重要数据。
- 不同主板的BIOS设置可能有所不同，具体按键和设置步骤请参考主板说明书。

通过以上步骤，您可以轻松制作一个PE系统U盘，以便在电脑遇到问题时进行紧急修复和系统维护。

## 下载链接

[制作PE系统U盘](https://pan.quark.cn/s/85dda437ab26)