---
layout: post
title: "RocketMQ 性能压测工具"
date:   2023-05-24
tags: [RocketMQ,压测,测试,性能,工具]
comments: true
author: admin
---
# RocketMQ 性能压测工具

## 简介

本仓库提供了一个功能强大的 RocketMQ 性能压测工具，旨在帮助开发者和测试人员进行 RocketMQ 的功能测试和性能测试。该工具封装自 RocketMQ 团队的 Benchmark，并经过严格测试，确保绝无 BUG。

## 功能优势

1. **绝无 BUG**：该工具基于 RocketMQ 团队的 Benchmark 进行封装，并经过本人测试，确保稳定性。
2. **功能强大**：覆盖普通消息、定时（延时）消息、事务消息（提交、回滚）等基本场景的发送场景，以及集群订阅和广播订阅的消费场景。支持多种命令行参数，如消费位点的调整、消息体大小调整、并发数调整、JVM 参数调优、延迟等级调整等，实现压测的精细化控制。
3. **简单易用**：每个压测场景都单独封装成 Shell 脚本，只需本地有 JAVA 环境，即可一键启动压测。

## 适用场景

- 后端开发同学进行功能测试或性能测试。
- 测试开发同学进行压力测试。

## 使用说明

1. 克隆本仓库到本地。
2. 确保本地已安装 JAVA 环境。
3. 根据需要选择相应的 Shell 脚本，一键启动压测。

## 注意事项

- 请确保 RocketMQ 服务已正确配置并启动。
- 根据实际测试需求调整脚本中的参数。

通过本工具，您可以轻松进行 RocketMQ 的性能压测，提升测试效率和质量。

## 下载链接

[RocketMQ性能压测工具](https://pan.quark.cn/s/c113991f6676)