---
layout: post
title: "现代密码学期末复习资料"
date:   2020-02-18
tags: [复习资料,学期末,整理,菜鸟,密码]
comments: true
author: admin
---
# 现代密码学期末复习资料

## 资源文件
**现代密码学期末知识点及例题整理.pdf**

## 描述
这份资源文件是我在中山大学期末考试前一天，根据张方国老师的PPT和各种复习题帖子整理的。由于时间紧迫，整理过程有些潦草，但内容应该还算凑合。考完试后发现确实复习到了不少重点。当然，由于时间有限，还是有很多遗漏的地方，毕竟只用了半天时间整理。

这份资料特别适合那些和我一样，考前才开始“预习”的小菜鸟们（尤其是我们学校的小菜鸟哦）。因为我们使用的教材和网上能找到的复习资料不太一样，所以我花了一些力气整理了一遍。老师的考试题型包括了选择、判断、填空和计算题，感觉押中了不少，所以来分享一下啦~

希望这份资料能帮助到大家，祝大家考试顺利！

## 下载链接

[现代密码学期末复习资料分享](https://pan.quark.cn/s/38db78a8519a)