---
layout: post
title: "TotalCommander 软件工具介绍"
date:   2020-03-22
tags: [快捷键,文件,TotalCommander,工具栏,插件]
comments: true
author: admin
---
# TotalCommander 软件工具介绍

TotalCommander（简称 TC）是一款功能强大的全能文件管理器，原名为 Windows Commander。它支持自定义菜单、工具栏和快捷键，为用户提供了极大的自由度，以打造个性化的文件管理体验。

## 功能介绍

1. **压缩与解压功能**：内置 ZIP/TAR/GZ/TGZ 格式的压缩/解压功能，支持创建加密及自解包功能。不仅可以直接打开（解开） ARJ/CAB/RAR/LZH/ACE/UC2 等压缩包，还可以通过插件或相应的压缩程序创建这些格式的压缩包。

2. **文件显示与管理**：除了支持详细资料、列表、缩略图等资源管理器也有的显示方式外，利用内容插件，支持各式各样的自定义列视图，显示不同文件的内部信息，满足用户查看不同文件的需求。

3. **多标签界面**：支持多标签界面，让用户可以同时操作多个文件夹，操作空间更显自由。

4. **外部程序调用**：通过工具栏和菜单，可以随意调用外部程序和内部命令，多种功能或强大或实用的插件，让 TC 如虎添翼。

5. **批量操作**：支持批量重命名和文件搜索，利用插件和正则表达式，功能更多更强。

## 软件特色

- **功能强大**：集成精选插件和实用工具，软件功能更具丰富、强大。
- **简单易用**：精心定制主菜单、工具栏等资源，操作更便捷。
- **多样化选择**：可选择多种安装类型，充分满足个性化、多样化的需求。

## 使用教程

1. **软件配置**：启动软件后点击菜单栏上的“配置” >> “选项”进入软件设置界面，可以设置主题颜色、字体、鼠标右键操作、编辑器程序等。

2. **添加工具栏程序**：TotalCommander 提供了快捷的工具栏程序，点击对应的工具栏程序可以快捷启动其他第三方应用软件。

3. **常用快捷键**：列举了一些常用的快捷键，如 F1 查看帮助文档，F2 刷新来源面板，F3 查看文件，F4 编辑文件等。

4. **重新定义快捷键**：用户可以根据自己的习惯重新定义快捷键，例如将文件重命名的快捷键修改为 F2。

TotalCommander 是一款功能全面、操作便捷的文件管理工具，适合各类用户使用。无论是日常文件管理，还是专业文件处理，TotalCommander 都能提供强大的支持。

## 下载链接

[TotalCommander软件工具介绍](https://pan.quark.cn/s/10564b593386)