---
layout: post
title: "使用EndNote X9自动生成毕设论文的参考文献"
date:   2020-07-04
tags: [文献,EndNote,参考文献,X9,毕设]
comments: true
author: admin
---
# 使用EndNote X9自动生成毕设论文的参考文献

本资源文件旨在帮助用户使用EndNote X9软件自动生成毕业论文的参考文献。通过本指南，您将学习如何创建文献库、向库中添加文献、将PDF链接到文献以及在Word中自动插入参考文献。

## 主要内容

### 1. 创建文献库
首先，您需要创建一个参考文献库来管理您的文献。具体步骤为：单击 `File` → `New`，然后选择一个合适的地址存放文献库并对文献库命名。

### 2. 向文献库中添加文献
创建完库后，第二步是向库中添加参考文献。本指南以常用的知网（中文）和Web of Science（英文）为例，演示了如何导入文献。

#### 2.1 知网
在知网中搜索到需要的文献并勾选选择框，导出与分析→导出文献→EndNote，导出。这一步之后会得到一个txt文件，txt文件打开方式选择EndNote或者直接拖进Endnote。

#### 2.2 Web of Science
在Web of Science中搜索需要的文献并勾选，导出→EndNote Desktop。这一步会得到一个ciw格式文件，直接双击打开ciw文件即可。

### 3. 将PDF链接到文献
将文献导入到文献库之后，如果您希望在EndNote里面就可以阅读文献或者对文献进行标注，就需要将文献的PDF链接到文献。具体操作：右键单击文献→File Attachments→Attach file。

### 4. 论文引用文献插入
这是写毕业论文时用到的最主要的功能，EndNote可以直接将引用文献按照设定插入Word中。使用这项功能，您首先需要在EndNote里面添加毕业论文格式，然后进行相关设置，最后在Word中插入参考文献。

## 结语
通过本指南，您将能够熟练使用EndNote X9自动生成毕业论文的参考文献，祝您毕设顺利！

## 下载链接

[使用EndNoteX9自动生成毕设论文的参考文献](https://pan.quark.cn/s/895e056c6368)