---
layout: post
title: "电子科技大学计算机体系结构实验报告 03：解决数据冒险问题"
date:   2020-12-26
tags: [冒险,数据,流水线,体系结构,实验报告]
comments: true
author: admin
---
# 电子科技大学计算机体系结构实验报告 03：解决数据冒险问题

## 资源文件概要

本实验报告全面阐述了电子科技大学 2021 年计算机体系结构课程第 3 次实验的内容，重点探讨了数据冒险问题的解决方式。

### 文件名

2021 电子科技大学计算机体系结构实验报告 03.pdf

### 文件内容

报告分为以下几个部分：

1. **使用纯暂停流水线技术解决数据冒险问题**

   - 分析了数据冒险出现的条件。
   - 探索了数据冒险检测机制。
   - 修改流水线 CPU 代码，当数据冒险发生时暂停流水线，保证程序运行结果的正确性。

2. **使用内部前推 + 暂停流水线技术解决数据冒险问题**

   - 细化了数据冒险出现的情形。
   - 探讨了数据冒险检测机制。
   - 修改流水线 CPU 代码，当数据冒险发生时采用数据前推处理，保证程序运行结果的正确性。
   - 分析了在非 Load 指令后出现数据冒险时，是否能通过纯粹的内部前推技术得到正确结果。
   - 分析了在检测到 Load 指令后出现数据冒险时，是否能通过内部前推数据 + 暂停流水线技术得到正确的计算结果。

通过本报告，读者可以深入了解计算机体系结构中的数据冒险问题及其解决原理，适用于计算机科学与技术专业学生和相关领域的研究人员。

## 下载链接

[2021电子科技大学-计算机体系结构实验报告03分享](https://pan.quark.cn/s/16a892ab1117)