---
layout: post
title: "KAIST行人数据集介绍"
date:   2024-06-23
tags: [数据,图片,标注,行人,包含]
comments: true
author: admin
---
# KAIST行人数据集介绍

## 数据集概述
KAIST行人数据集是一个包含95328张图片的多光谱行人检测数据集，每张图片都包含RGB彩色图像和红外图像两个版本。数据集总共包含103128个密集注释，分别在白天和晚上捕获了包括校园、街道以及乡下的各种常规交通场景。图片大小为640×480，数据集总共分为12个文件夹set00-set11，前6个文件夹为训练集包含50187张图片，后6个文件夹为测试集包含45141张图片。

## 数据集标签
数据集的标签中包含person、people和cyclist三个类别。比较好区分的个体则被标注为person，不太好分辨的多个个体则被标注为people，骑行的人则被标注为cyclist。当标注的时候，连标注者都分不清那块区域到底是行人还是什么其他的物体时，则被标注为person。

## 数据集来源
该数据集来源于KAIST官方发布，包含丰富的图像对，具有重要的研究意义。

## 数据集清洗
多数使用KAIST的论文中的数据集都是经过清洗了的，因为本数据集是取自视频连续帧图片，相邻图片相差不大，故进行一定程度的清洗。清洗规则如下：
- 训练集每隔2张图片取一张，既每3张取一张，并去掉所有不包含任何行人的图片（数据集中有很多图片是负样本），既选出来的图片中至少包含一个目标，且剔除数据集中严重遮挡、只有半截或者小于50个像素的行人。经过此操作可得到7601张训练集图片，4755张白天的，2846张夜晚的。
- 测试集每隔19张取一张，既每20张取一张，保留负样本（图片中不包含任何目标）。经此操作可得到2252张图片，1455张白天，797张夜晚。

## 标签质量提升
由于原数据集样本标注效果较差，故有的论文作者对数据集进行了一定程度的重新标注，既对标注质量进行了提升。对于标签提升的是上述清洗过的数据集。

## 使用说明
该数据集适用于多光谱行人检测研究，特别适合用于训练和测试行人检测算法。数据集的标签文件中可以通过文件名称，在原数据集中找到相应的图片。

## 注意事项
在使用该数据集时，请注意数据集的版权声明，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接和本声明。

## 下载链接

[KAIST行人数据集介绍](https://pan.quark.cn/s/6cf9e5054687)