---
layout: post
title: "雷达数据处理及应用_何友，修建娟，关欣"
date:   2020-05-27
tags: [雷达,数据处理,何友,关欣,目标]
comments: true
author: admin
---
# 雷达数据处理及应用_何友，修建娟，关欣

## 资源描述

本书系统地介绍了国内外多年来雷达数据自理技术的研究进展情况及作者们的研究成果。全书由15章组成。主要内容有：雷达数据自理的研究目的、意义、应用领域、历史和现状，状态估计与线性滤波方法，非线性滤波方法，量测数据预处理技术，多目标跟踪中的航迹起始，极大似然类多目标数据互联方法，贝叶斯类多目标数据互联方法，机动目标跟踪，多目标跟踪终结理论与航迹质量管理，无源雷达数据处理技术，相控阵雷达和脉冲多普勒雷达数据处理技术，雷达网数据处理技术，雷达数据处理仿真技术，雷达数据处理的实际应用，以及本书的回顾、建议与展望。

## 适用对象

本书可供从事信息工程、C3I系统、雷达工程、电子对抗、红外、声纳、军事指挥等专业的科技人员阅读和参考，还可作为上述专业的高年级本科生或研究生教材。同时也可供从事激光、机器人、遥感、遥测等领域的工程技术人员参考。

## 下载说明

本仓库提供《雷达数据处理及应用_何友，修建娟，关欣》一书的资源文件下载。请根据需要下载相关文件。

## 下载链接

[雷达数据处理及应用_何友修建娟关欣](https://pan.quark.cn/s/39a651587fde)