---
layout: post
title: "IEMOCAP数据集介绍"
date:   2022-04-03
tags: [语音,数据,IEMOCAP,情感,文本]
comments: true
author: admin
---
# IEMOCAP数据集介绍

IEMOCAP数据集是一个广泛使用的语音情感识别数据集，由南加州大学（USC）的语音分析和口译实验室（SAIL）收集。该数据集包含了大约12小时的视听数据，包括视频、语音、面部动作捕捉和文本转录。数据集由两部分组成，参与者在其中进行即兴表演或剧本剧本，特别是为了引起情感表达而选择的。

## 数据集内容

- **视频和音频**：包含参与者的对话视频和相应的音频文件。
- **面部动作捕捉**：详细记录了参与者的面部表情和手部动作。
- **文本转录**：提供了对话的文本转录，便于文本分析。

## 情感标签

IEMOCAP数据集由多个注释者注释为类别标签，例如愤怒、幸福、悲伤、中立，以及维数标签（如价、激活和支配）。这些标签为情感识别提供了丰富的数据支持。

## 应用领域

该数据集不仅适用于语音情感识别任务，还可以用于其他语音任务，如语音识别和语音合成。其详细的动作捕捉信息、引发真实情感的交互式设置以及数据库的大小，使其成为研究和建模多模式和表达性人类交流的有价值资源。

## 下载方式

用户可以通过官方地址或提供的百度网盘链接进行下载。由于数据集较大，建议使用高速网络或开通百度网盘会员以加快下载速度。

## 使用注意事项

在下载和使用数据集之前，请仔细阅读相关的使用说明和许可协议，以确保合法和适当使用。

## 下载链接

[IEMOCAP数据集介绍](https://pan.quark.cn/s/d34bbd181a10)