---
layout: post
title: "快速傅里叶变换：算法与应用"
date:   2023-12-25
tags: [FFT,....,页码,算法,傅里叶]
comments: true
author: admin
---
# 快速傅里叶变换：算法与应用

## 资源文件描述

**标题**: 快速傅里叶变换：算法与应用  
**作者**: K.R. Rao, D.N. Kim, J.-J. Hwang  
**系列**: 信号与通信技术  
**出版社**: Springer Netherlands  
**年份**: 2010  
**版本**: 1  
**语言**: 英语  
**页数**: 426\437  
**ISBN**: 1402066287, 9781402066283

## 内容简介

《快速傅里叶变换：算法与应用》是一本介绍快速傅里叶变换（FFT）原理的书籍。本书涵盖了FFT的基本原理、频域滤波以及在视频和音频信号处理中的应用。随着通信、语音和图像处理等领域的快速发展，FFT作为数字信号处理中的关键技术，得到了广泛应用。因此，教师和学生迫切需要一本涵盖最新FFT主题的书籍。

本书详细解释了各种重要的FFT算法，并采用了现代的教学方法，如MATLAB示例和项目，以帮助读者更好地理解不同的FFT算法。本书适合高年级本科生、研究生、教师、工程师和科学家，以及自学者使用。它既可以作为教材，也可以作为参考书。书中提供了大量的MATLAB示例、项目和问题，帮助读者具体掌握FFT的概念。此外，书中还包含了参考书籍、综述论文、应用列表、硬件/软件资源以及有用的网站信息。

通过包含许多图表、表格、框图和图形，本书帮助读者直观地理解快速算法的概念。书中还提供了新的MATLAB函数和源代码。《快速傅里叶变换：算法与应用》不要求读者具备FFT的先验知识，适合任何希望了解FFT最新发展和应用的专业人士。对于计划在这一领域从事基本实现或研究开发的工程师来说，本书也是一本很好的参考书。

## 目录

- 前言....页码 i-xviii
- 引言....页码 1-3
- 离散傅里叶变换....页码 5-40
- 快速算法....页码 41-110
- 整数快速傅里叶变换....页码 111-126
- 二维离散傅里叶变换....页码 127-184
- 向量基二维FFT算法....页码 185-193
- 非均匀DFT....页码 195-234
- 应用....页码 235-316
- 后记....页码 317-423

## 适用人群

本书适合以下人群使用：
- 高年级本科生和研究生
- 教师和研究人员
- 工程师和科学家
- 自学者

## 使用建议

本书提供了丰富的MATLAB示例和项目，建议读者在学习过程中结合实际操作，以加深对FFT算法的理解。同时，书中提供的参考资料和应用列表也可以作为进一步学习和研究的资源。

## 下载链接

[快速傅里叶变换算法与应用分享](https://pan.quark.cn/s/78fdc65e63a6)