---
layout: post
title: "用户手册"
date:   2099-1-26
tags: [notice]
comments: true
author: admin
---


您是第一次来到我的博客吗？来瞧瞧这篇博主为读者们精心准备的无比简短的《用户手册》吧！预祝您在我的博客里收获一个良好的阅读体验！


<!-- more -->
### 注意
网站上所有的资源均来源于网友采集分享,本站不对资源拥有任何版权,如果发生侵权行为,请在 [交流社区](https://github.com/donwloadres/donwloadres.github.io/issues) 提交,将第一时间进行删除!


### 目录

- [如何评论？](#如何评论)
- [如何快速查找文章？](#如何快速查找文章)
- [如何收藏文章？](#如何收藏文章)
- [如何在新标签页中打开链接？](#如何在新标签页中打开链接)

## 如何评论？

**本站点暂不支持直接评论**，如果您有相关需求，可以通过以下方式间接评论：

- 移步至[本博客的 GitHub 官方评论区](https://github.com/donwloadRes/donwloadRes.github.io/issues)，在这里您可以自由发表各种类型的评论并与其他人进行互动。
  
  
- 如果您想针对某一个文章或议题发表您的疑问，并希望得到更精确的解答，推荐您使用 [GitHub 提供的 issues 交流社区](https://github.com/donwloadres/donwloadres.github.io/issues)，您也可以在这里解答他人的疑惑。除此之外，如果您发现我的文章中存在技术性错误，或者认为我的博客需要再添加一些功能，也可以在这里提出。
  
 
## 如何快速查找文章？

- **通过首页搜索框输入文章标题或标签进行查找**

  首页搜索框支持针对文章标题和标签的子集式查找，即输入部分标题或标签中的字符即可显示含有相应字符的结果。对于这种方法，用户需要注意的有以下两点：
  
  - 本站文章标题会遵循关键字原则，从而提高用户搜索的匹配率。但如果标题中不含有您输入的文字，或者您输入的文字当中存在标题中不含有的字符，则不会显示出搜索结果。如果您要通过标题查找文章，建议您尽量使用最少量的文字。

   

- **在分类页面通过标签查找**

  本站所有文章都会附有相应的标签，表示文章的主题分类。推荐您使用这种方式，这样确保不会遗漏您想要查找的结果。

## 如何收藏文章？

**本站不设有用户系统**，也就是说您无法在本站内部做任何由用户自定义的操作，包括收藏文章。不过您可以将文章所在的网页地址收藏在浏览器当中。无论您使用的什么浏览器，都支持对收藏的网址进行分配收藏夹、重命名等操作。当然，您也可以选择其他方式保存，比如把文章链接传到您的微信等地方，这由您自己决定。

## 如何在新标签页中打开链接？

**本网站所有链接都是默认在当前页面打开的**，这样也许会对读者造成一些不方便。原谅博主并不打算改变链接的打开方式，博主窃以为读者会自己解决这个问题（右键-->在新标签页中打开链接）。

-------

如果您觉得我的文章写得不错，对您很有帮助，可以在 github 上关注我。除此之外，我非常愿意您向他人分享我的文章，推荐我的博客。创作不易，您的支持就是对我最大的鼓励。
